# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # A cat(1) clone with wings.
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fnm'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'pinentry-mac'
brew 'grep'
brew 'tldr'
brew 'wp-cli'

# Development
brew 'php'
brew 'php@8.1'
brew 'composer'
brew 'nginx'

# Apps
cask '1password'
cask 'iterm2'
cask 'dbngin'
cask 'firefox'
cask 'google-chrome'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
