# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # A cat(1) clone with wings.
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fnm'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'tlrc'
brew 'svn'
brew 'wp-cli'
brew 'starship'
brew 'zsh-autosuggestions'

# Development
brew 'php@8.3'
brew 'composer'

# Apps
cask '1password'
cask 'brave-browser'
cask 'cleanshot'
cask 'dbngin'
cask 'firefox'
cask 'google-chrome'
cask 'iina'
cask 'iterm2'
cask 'font-jetbrains-mono-nerd-font'
cask 'numi'
cask 'obsidian'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
